------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\Program Files\Stata15\LogitMultinomial.txt
  log type:  text
 opened on:  28 Feb 2025, 05:20:32

. tabulate tempo_ordinal

 tempo_ordinal |      Freq.     Percent        Cum.
---------------+-----------------------------------
         1 ano |  3,537,990       35.51       35.51
    1 a 5 anos |  4,172,382       41.87       77.38
Mais de 5 anos |  2,253,567       22.62      100.00
---------------+-----------------------------------
         Total |  9,963,939      100.00

. tabulate sexotrabalhador

       Sexo |
Trabalhador |      Freq.     Percent        Cum.
------------+-----------------------------------
  Masculino |  5,526,587       55.47       55.47
   Feminino |  4,437,352       44.53      100.00
------------+-----------------------------------
      Total |  9,963,939      100.00

. tabulate estado

     estado |      Freq.     Percent        Cum.
------------+-----------------------------------
         RS |  3,233,873       32.46       32.46
         SC |  3,017,942       30.29       62.74
         PR |  3,712,124       37.26      100.00
------------+-----------------------------------
      Total |  9,963,939      100.00

. tabulate raÃ§acor

     RaÃ§a Cor |      Freq.     Percent        Cum.
--------------+-----------------------------------
     IndÃ­gena |     18,552        0.19        0.19
       Branca |  6,133,320       61.56       61.74
        Preta |    380,906        3.82       65.56
      Amarela |     44,402        0.45       66.01
        Parda |  1,202,773       12.07       78.08
NÃ£o informado |  2,183,986       21.92      100.00
--------------+-----------------------------------
        Total |  9,963,939      100.00

. tabulate escolaridadeapÃ³s2005

      Escolaridade apÃ³s 2005 |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                  Analfabeto |     34,939        0.35        0.35
           5Âº ano incompleto |    155,292        1.56        1.91
             5Âº ano completo |    151,820        1.52        3.43
                6Âº ao 9Âº ano |    482,712        4.84        8.28
          Ensino Fundamental |    829,633        8.33       16.60
     Ensino MÃ©dio incompleto |    749,017        7.52       24.12
                Ensino MÃ©dio |  5,556,814       55.77       79.89
EducaÃ§Ã£o Superior incompleta |    592,421        5.95       85.84
           EducaÃ§Ã£o Superior |  1,355,841       13.61       99.44
                    Mestrado |     39,141        0.39       99.84
                   Doutorado |     16,309        0.16      100.00
-----------------------------+-----------------------------------
                       Total |  9,963,939      100.00

. tabulate cbo_agrup

  cbo_agrup |      Freq.     Percent        Cum.
------------+-----------------------------------
       GG 0 |         75        0.00        0.00
       GG 1 |    399,177        4.01        4.01
       GG 2 |    738,615        7.41       11.42
       GG 3 |    953,229        9.57       20.99
       GG 4 |  1,828,881       18.35       39.34
       GG 5 |  2,515,082       25.24       64.58
       GG 6 |    108,941        1.09       65.68
       GG 7 |  2,609,753       26.19       91.87
       GG 8 |    543,724        5.46       97.33
       GG 9 |    262,204        2.63       99.96
       GG ? |      4,258        0.04      100.00
------------+-----------------------------------
      Total |  9,963,939      100.00

. tabulate cnae_agrup

 cnae_agrup |      Freq.     Percent        Cum.
------------+-----------------------------------
          A |     93,589        0.94        0.94
          B |     25,264        0.25        1.19
          C |  2,623,240       26.33       27.52
          D |     29,643        0.30       27.82
          E |     68,494        0.69       28.51
          F |    533,926        5.36       33.86
          G |  2,471,648       24.81       58.67
          H |    638,055        6.40       65.07
          I |    475,936        4.78       69.85
          J |    265,749        2.67       72.52
          K |    205,323        2.06       74.58
          L |     45,748        0.46       75.04
          M |    281,113        2.82       77.86
          N |    180,818        1.81       79.67
          O |    905,131        9.08       88.76
          P |    363,147        3.64       92.40
          Q |    502,304        5.04       97.44
          R |     63,642        0.64       98.08
          S |    190,678        1.91      100.00
          T |        348        0.00      100.00
          U |        143        0.00      100.00
------------+-----------------------------------
      Total |  9,963,939      100.00

. tabulate nac

        nac |      Freq.     Percent        Cum.
------------+-----------------------------------
 Brasileiro |  9,793,035       98.28       98.28
Estrangeiro |    170,904        1.72      100.00
------------+-----------------------------------
      Total |  9,963,939      100.00

. tabulate afastamento

        afastamento |      Freq.     Percent        Cum.
--------------------+-----------------------------------
        Nenhum (99) |  7,646,770       76.74       76.74
LicenÃ§a-maternidade |    162,250        1.63       78.37
           Acidente |    103,379        1.04       79.41
             DoenÃ§a |  2,015,377       20.23       99.64
             Outros |     36,163        0.36      100.00
--------------------+-----------------------------------
              Total |  9,963,939      100.00

. tabulate tamanhoestabelecimento

     Tamanho |
Estabelecime |
         nto |      Freq.     Percent        Cum.
-------------+-----------------------------------
        Zero |    226,490        2.27        2.27
    De 1 a 4 |  1,245,933       12.50       14.78
    De 5 a 9 |  1,120,222       11.24       26.02
  De 10 a 19 |  1,293,450       12.98       39.00
  De 20 a 49 |  1,503,550       15.09       54.09
  De 50 a 99 |    999,310       10.03       64.12
De 100 a 249 |  1,139,407       11.44       75.56
De 250 a 499 |    725,113        7.28       82.83
De 500 a 999 |    573,908        5.76       88.59
1000 ou Mais |  1,136,556       11.41      100.00
-------------+-----------------------------------
       Total |  9,963,939      100.00

. mlogit tempo_ordinal ///
>        i.sexotrabalhador i.estado i.raÃ§acor ///
>        i.escolaridadeapÃ³s2005 c.idade i.cbo_agrup ///
>            i.cnae_agrup i.nac i.afastamento ///
>            i.tamanhoestabelecimento, vce(robust) rrr baseoutcome(0)

Iteration 0:   log pseudolikelihood =  -10645114  
Iteration 1:   log pseudolikelihood =   -9577620  
Iteration 2:   log pseudolikelihood =   -9500955  
Iteration 3:   log pseudolikelihood = -9500052.2  
Iteration 4:   log pseudolikelihood = -9500051.6  
Iteration 5:   log pseudolikelihood = -9500051.6  

Multinomial logistic regression                 Number of obs     =  9,963,939
                                                Wald chi2(126)    = 1729277.09
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -9500051.6               Pseudo R2         =     0.1076

------------------------------------------------------------------------------
             |               Robust
tempo_ordi~l |        RRR   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1_ano        |  (base outcome)
-------------+----------------------------------------------------------------
1_a_5_anos   |
sexotrabal~r |
   Feminino  |   .8807159    .001465   -76.36   0.000     .8778493    .8835918
             |
      estado |
         SC  |   .9614715    .001822   -20.73   0.000     .9579071    .9650492
         PR  |   .9602323     .00174   -22.39   0.000     .9568281    .9636486
             |
     raÃ§acor |
     Branca  |   1.142039   .0190871     7.95   0.000     1.105235    1.180069
      Preta  |   1.020306   .0174331     1.18   0.239     .9867033    1.055053
    Amarela  |   .9631079   .0194694    -1.86   0.063     .9256946    1.002033
      Parda  |   .9117506   .0153179    -5.50   0.000      .882217    .9422729
NÃ£o infor..  |   .9137632   .0153121    -5.38   0.000     .8842395    .9442727
             |
escolar~2005 |
5Âº ano in..  |   1.110755   .0152672     7.64   0.000     1.081231    1.141085
5Âº ano co..  |   1.145186    .015965     9.72   0.000     1.114319    1.176908
 6Âº ao 9Â..  |   1.100708    .013987     7.55   0.000     1.073633    1.128466
Ensino Fu..  |   1.156485   .0144607    11.63   0.000     1.128487    1.185178
Ensino MÃ©..  |    1.27627   .0159823    19.48   0.000     1.245327    1.307983
Ensino MÃ©..  |   1.219021   .0149711    16.13   0.000     1.190029     1.24872
EducaÃ§Ã£o ..  |   1.362742   .0172444    24.46   0.000     1.329359    1.396963
EducaÃ§Ã£o ..  |   1.238735   .0155319    17.07   0.000     1.208664    1.269554
   Mestrado  |   1.406574   .0268473    17.87   0.000     1.354927    1.460191
  Doutorado  |   1.439423   .0396742    13.22   0.000     1.363726    1.519322
             |
       idade |   1.024879   .0000772   326.41   0.000     1.024728     1.02503
             |
   cbo_agrup |
       GG 1  |   1.213766   .3666961     0.64   0.521     .6713902    2.194296
       GG 2  |   1.226647   .3705772     0.68   0.499     .6785267    2.217546
       GG 3  |   1.101976   .3329044     0.32   0.748     .6095737    1.992132
       GG 4  |   1.014472    .306463     0.05   0.962     .5611766     1.83392
       GG 5  |   .8095628   .2445602    -0.70   0.484     .4478285    1.463489
       GG 6  |   .7779037   .2350746    -0.83   0.406     .4302308    1.406534
       GG 7  |   .7804951   .2357812    -0.82   0.412     .4317468    1.410949
       GG 8  |   .9393622   .2837889    -0.21   0.836     .5196108    1.698197
       GG 9  |   1.009119   .3048782     0.03   0.976     .5581804    1.824358
       GG ?  |   1.183157   .3598653     0.55   0.580     .6518436    2.147539
             |
  cnae_agrup |
          B  |   1.252244   .0225643    12.48   0.000      1.20879    1.297259
          C  |   1.311686   .0112852    31.53   0.000     1.289753    1.333993
          D  |   1.808758   .0384649    27.87   0.000     1.734918    1.885741
          E  |   .8691925   .0112485   -10.83   0.000     .8474231    .8915212
          F  |   .6895222   .0062123   -41.26   0.000     .6774532    .7018063
          G  |   1.064333   .0091844     7.23   0.000     1.046483    1.082487
          H  |   1.036126   .0092665     3.97   0.000     1.018123    1.054449
          I  |   .8003373   .0073469   -24.26   0.000     .7860665    .8148673
          J  |   1.313406   .0127206    28.15   0.000     1.288709    1.338576
          K  |   .8713554   .0090398   -13.27   0.000     .8538165    .8892545
          L  |   1.089011   .0150651     6.16   0.000      1.05988    1.118942
          M  |   1.019887   .0097148     2.07   0.039     1.001023    1.039107
          N  |   .9146006   .0090678    -9.00   0.000     .8969997    .9325469
          O  |   .8856132   .0078472   -13.71   0.000     .8703658    .9011278
          P  |   .9443522   .0090182    -6.00   0.000     .9268413    .9621939
          Q  |    1.08779   .0100875     9.07   0.000     1.068198    1.107742
          R  |   .8641016    .010698   -11.80   0.000     .8433862    .8853257
          S  |   1.088278   .0111139     8.28   0.000     1.066712     1.11028
          T  |   .7268768   .0818119    -2.83   0.005     .5829829    .9062872
          U  |   2.442157   .7133339     3.06   0.002     1.377668    4.329149
             |
         nac |
Estrangeiro  |   .6446753   .0034514   -82.00   0.000     .6379461    .6514755
             |
 afastamento |
LicenÃ§a-m~e  |   6.777948   .0552568   234.74   0.000     6.670507    6.887119
   Acidente  |   2.055095   .0160253    92.37   0.000     2.023925    2.086745
     DoenÃ§a  |   1.492169   .0028871   206.85   0.000     1.486521    1.497838
     Outros  |   1.998783   .0320795    43.15   0.000     1.936887    2.062657
             |
tamanhoest~o |
   De 1 a 4  |   1.117755   .0056123    22.17   0.000     1.106809    1.128809
   De 5 a 9  |   1.013323   .0051251     2.62   0.009     1.003328    1.023418
 De 10 a 19  |    .946949   .0047339   -10.90   0.000      .937716    .9562729
 De 20 a 49  |   .9319486   .0046152   -14.23   0.000     .9229467    .9410382
 De 50 a 99  |   .9166952   .0047204   -16.89   0.000     .9074899    .9259939
De 100 a ..  |   .9113281    .004665   -18.14   0.000     .9022307    .9205173
De 250 a ..  |   1.005493   .0054837     1.00   0.315     .9948022    1.016298
De 500 a ..  |    1.04754   .0059944     8.12   0.000     1.035857    1.059354
1000 ou M..  |   1.093737   .0058024    16.89   0.000     1.082423    1.105169
             |
       _cons |   .4192524   .1270049    -2.87   0.004     .2315365    .7591572
-------------+----------------------------------------------------------------
Mais_de_5_~s |
sexotrabal~r |
   Feminino  |   .7397349   .0015958  -139.74   0.000     .7366137    .7428693
             |
      estado |
         SC  |   .8799731   .0021466   -52.42   0.000     .8757759    .8841905
         PR  |   .8811134   .0020503   -54.39   0.000     .8771041     .885141
             |
     raÃ§acor |
     Branca  |   1.739969   .0393584    24.49   0.000     1.664513    1.818846
      Preta  |   1.165008    .026926     6.61   0.000     1.113412    1.218996
    Amarela  |   1.626578   .0426189    18.57   0.000     1.545155    1.712291
      Parda  |   .8540723   .0194447    -6.93   0.000     .8167992    .8930464
NÃ£o infor..  |   .5383182   .0122478   -27.22   0.000     .5148404    .5628667
             |
escolar~2005 |
5Âº ano in..  |   1.402438   .0262074    18.10   0.000     1.352002    1.454756
5Âº ano co..  |   1.987078   .0370951    36.78   0.000     1.915687    2.061129
 6Âº ao 9Â..  |   1.663121    .029419    28.76   0.000     1.606449    1.721793
Ensino Fu..  |   1.815498    .031769    34.08   0.000     1.754288    1.878844
Ensino MÃ©..  |   1.976212   .0347882    38.70   0.000     1.909191    2.045585
Ensino MÃ©..  |   1.669033   .0288425    29.64   0.000     1.613449    1.726531
EducaÃ§Ã£o ..  |    1.88082   .0334118    35.56   0.000     1.816461     1.94746
EducaÃ§Ã£o ..  |   1.939556   .0340089    37.78   0.000     1.874032     2.00737
   Mestrado  |   2.275282   .0522038    35.83   0.000      2.17523    2.379935
  Doutorado  |   2.764566   .0821661    34.21   0.000     2.608124    2.930392
             |
       idade |   1.095703   .0000989  1012.80   0.000     1.095509    1.095897
             |
   cbo_agrup |
       GG 1  |   .7820412   .2550276    -0.75   0.451     .4127134    1.481872
       GG 2  |   .6722203   .2192085    -1.22   0.223     .3547628    1.273753
       GG 3  |   .5994487   .1954717    -1.57   0.117     .3163642    1.135839
       GG 4  |    .542967   .1770495    -1.87   0.061     .2865599    1.028801
       GG 5  |   .3036325   .0990073    -3.66   0.000     .1602477    .5753136
       GG 6  |   .2781463   .0907425    -3.92   0.000     .1467496    .5271929
       GG 7  |   .2718655   .0886495    -3.99   0.000     .1434813    .5151251
       GG 8  |   .4493693   .1465392    -2.45   0.014     .2371521    .8514907
       GG 9  |   .5183064   .1690318    -2.02   0.044     .2735205    .9821623
       GG ?  |   .5142783   .1693614    -2.02   0.043     .2697004    .9806516
             |
  cnae_agrup |
          B  |   1.693253   .0362825    24.58   0.000     1.623614     1.76588
          C  |   1.531132   .0172322    37.85   0.000     1.497728    1.565282
          D  |   3.648076   .0804267    58.70   0.000       3.4938    3.809165
          E  |   1.349081   .0206753    19.54   0.000     1.309161    1.390219
          F  |   .3448276   .0042028   -87.36   0.000      .336688    .3531641
          G  |   .9994798   .0113162    -0.05   0.963     .9775448    1.021907
          H  |   .8736514   .0102209   -11.55   0.000     .8538467    .8939154
          I  |   .5644288    .006978   -46.26   0.000     .5509166    .5782725
          J  |   .8306343   .0106316   -14.50   0.000      .810056    .8517354
          K  |    1.39962   .0178186    26.41   0.000     1.365128    1.434983
          L  |    .964427   .0173398    -2.01   0.044     .9310335    .9990182
          M  |   .8041362   .0101514   -17.27   0.000      .784484    .8242807
          N  |    .263022   .0038104   -92.19   0.000     .2556587    .2705974
          O  |   .6147451   .0071588   -41.78   0.000      .600873    .6289375
          P  |   .8890745   .0109314    -9.56   0.000     .8679053    .9107599
          Q  |   1.047051    .012527     3.84   0.000     1.022784    1.071894
          R  |    .722473   .0118774   -19.77   0.000     .6995647    .7461315
          S  |   1.343793   .0174102    22.81   0.000     1.310099    1.378353
          T  |   .1736009   .0455112    -6.68   0.000     .1038486    .2902038
          U  |   6.594532   1.923074     6.47   0.000     3.723571    11.67907
             |
         nac |
Estrangeiro  |   .1891846   .0021154  -148.91   0.000     .1850837    .1933764
             |
 afastamento |
LicenÃ§a-m~e  |   6.703129   .0644058   198.01   0.000     6.578077    6.830558
   Acidente  |   1.440828   .0141929    37.08   0.000     1.413277    1.468916
     DoenÃ§a  |   1.443302   .0035002   151.30   0.000     1.436458    1.450179
     Outros  |   4.293272   .0704547    88.79   0.000     4.157381    4.433606
             |
tamanhoest~o |
   De 1 a 4  |   2.095537   .0173195    89.51   0.000     2.061865    2.129759
   De 5 a 9  |   1.737672   .0144676    66.37   0.000     1.709546     1.76626
 De 10 a 19  |   1.598454   .0131833    56.87   0.000     1.572823    1.624503
 De 20 a 49  |    1.57269   .0128674    55.34   0.000     1.547671    1.598113
 De 50 a 99  |   1.618842   .0135501    57.55   0.000     1.592501    1.645619
De 100 a ..  |   1.709649   .0141862    64.63   0.000      1.68207    1.737681
De 250 a ..  |   2.201229    .018812    92.32   0.000     2.164666    2.238411
De 500 a ..  |   2.655838    .023148   112.07   0.000     2.610854    2.701597
1000 ou M..  |   2.911075   .0243708   127.63   0.000     2.863698    2.959235
             |
       _cons |   .0131573   .0043095   -13.22   0.000     .0069241    .0250017
------------------------------------------------------------------------------
Note: _cons estimates baseline relative risk for each outcome.

. log close
      name:  <unnamed>
       log:  D:\Program Files\Stata15\LogitMultinomial.txt
  log type:  text
 closed on:  28 Feb 2025, 05:28:24
------------------------------------------------------------------------------
